ГТС/УТГТС/DataProcessors/ПанельАдминистрированияУчетПрослеживаемыхТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПанельАдминистрированияУчетПрослеживаемыхТоваров</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

ГТС/УТГТС/Enums/ВыборГруппыСкладов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВыборГруппыСкладов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запретить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазрешитьВЗаказах</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазрешитьВЗаказахИНакладных</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Enums/ТипыСкладов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыСкладов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОптовыйСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РозничныйМагазин</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Enums/УровниОбслуживания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>УровниОбслуживания</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УровеньОбслуживания50_0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УровеньОбслуживания57_9</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УровеньОбслуживания65_5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УровеньОбслуживания72_6</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УровеньОбслуживания78_8</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УровеньОбслуживания84_0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УровеньОбслуживания88_5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УровеньОбслуживания91_9</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УровеньОбслуживания94_5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УровеньОбслуживания96_4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УровеньОбслуживания97_7</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УровеньОбслуживания98_6</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УровеньОбслуживания99_2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УровеньОбслуживания99_5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УровеньОбслуживания99_7</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УровеньОбслуживания99_9</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Enums/ИсточникиИнформацииОЦенахДляПечати.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ИсточникиИнформацииОЦенахДляПечати</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоВидуЦен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСебестоимости</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Enums/ИспользованиеСкладскихРабочихУчастков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ИспользованиеСкладскихРабочихУчастков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеИспользовать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Использовать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОпределяетсяНастройкамиПомещения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/DataProcessors/ПанельАдминистрированияУчетПрослеживаемыхТоваров/Forms/ВыборСклада/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Склад = Параметры.Склад;
	
	ПравоСозданияСклада = ПравоДоступа("Добавление", Метаданные.Справочники.Склады);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"СгенерироватьСклад",
		"Видимость",
		ПравоСозданияСклада);
	
	ЗаголовокЭлемента = СтрШаблон(Элементы.ДекорацияИнформация.Заголовок, ?(ПравоСозданияСклада, НСтр("ru='или сгенерируйте новый'"),""));
	Элементы.ДекорацияИнформация.Заголовок = ЗаголовокЭлемента;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СгенерироватьСклад(Команда)
	СгенерироватьСкладНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
	Закрыть(Склад);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СгенерироватьСкладНаСервере()
	
	НовыйСклад = Справочники.Склады.СоздатьЭлемент();
	НовыйСклад.ВыборГруппы                       = Перечисления.ВыборГруппыСкладов.Запретить;
	НовыйСклад.ТипСклада                         = Перечисления.ТипыСкладов.ОптовыйСклад;
	НовыйСклад.УровеньОбслуживания               = Перечисления.УровниОбслуживания.УровеньОбслуживания84_0;
	НовыйСклад.ИсточникИнформацииОЦенахДляПечати = Перечисления.ИсточникиИнформацииОЦенахДляПечати.ПоСебестоимости;
	НовыйСклад.ИспользованиеРабочихУчастков      = Перечисления.ИспользованиеСкладскихРабочихУчастков.НеИспользовать;
	НовыйСклад.УчитыватьСебестоимостьПоСериям    = Истина;
	НовыйСклад.КонтролироватьСвободныеОстатки    = Истина;
	НовыйСклад.Наименование                      = НСтр("ru='Виртуальный склад прослеживаемых товаров'");
	НовыйСклад.Записать();
	
	Склад = НовыйСклад.Ссылка;
	
КонецПроцедуры

#КонецОбласти
